InformationRegisters/Автомобили.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Автомобили</Name>
			<Comment>Дополнительные характеристики автомобилей</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Comment>Значение дополнительного свойства</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодтверждающиеДокументы</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:Type>cfg:EnumRef.ВидАвтомобиля</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КтоВнес</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КогдаВнес</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Автомобиль</Name>
					<Comment>Автомобиль</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЗначения</Name>
					<Comment>Вид значения дополнительного свойства автомобиля</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ДополнительнаяИнформацияАвтомобилей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КонтактнаяИнформация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>КонтактнаяИнформация</Name>
			<Comment>Контактная информация контрагентов, контактных лиц, организаций и сотрудников</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Comment>Признак значения по умолчанию</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Произвольный комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле1</Name>
					<Comment>Вспомогательное поле: "Код страны" или "Индекс"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле2</Name>
					<Comment>Вспомогательное поле: "Код города" или "Регион"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле3</Name>
					<Comment>Вспомогательное поле: "Номер телефона" или "Район"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле4</Name>
					<Comment>Вспомогательное поле: "Внутренний (или добавочный)  номер" или "Город"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле5</Name>
					<Comment>Вспомогательное поле: "Населенный пункт"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле6</Name>
					<Comment>Вспомогательное поле: "Улица"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле7</Name>
					<Comment>Вспомогательное поле: "Дом"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле8</Name>
					<Comment>Вспомогательное поле: "Корпус"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле9</Name>
					<Comment>Вспомогательное поле: "Квартира"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Comment>Строковое представление контактной информации</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле10</Name>
					<Comment>Вспомогательное поле: "Подъезд"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле11</Name>
					<Comment>Вспомогательное поле: "Этаж"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле12</Name>
					<Comment>Вспомогательное поле: "Код двери/домофон"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтанцияМетро</Name>
					<Comment>Станция метро</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтанцииМетро</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГородскойРайон</Name>
					<Comment>Городской район проживания</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Районы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>CRM_ПолеХраненияНомера</Name>
					<Comment>Индексирование тел. номера для поиска</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>31</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипДома</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДомов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКорпуса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКорпусов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКвартир</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КраткоеПредставление</Name>
					<Comment>Краткое представление</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект-владелец контактной информации</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияГК</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКонтрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тип</Name>
					<Comment>Тип контактной информации</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Comment>Вид контактной информации</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ДополнительнаяИнформацияАвтомобилей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ДополнительнаяИнформацияАвтомобилей</Name>
			<Comment>Дополнительная информация автомобилей</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Хозяин</Name>
					<Comment>Признак хозяина автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пробег</Name>
					<Comment>Признак пробега автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГосНомер</Name>
					<Comment>Признак государственного номера автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТехПаспорт</Name>
					<Comment>Признак номера техпаспорта автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВидАвтомобиля</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДатаКонсигнации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СервиснаяКнижка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПараллельныйИмпорт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДатаОкончанияОтсрочкиОплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГаражныйНомер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапретНаВнутренниеПерепродажи</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
			<Comment>Типы контактной информации</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
					<Comment>Телефон</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
					<Comment>Адрес</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
					<Comment>E-Mail</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
					<Comment>Веб-страница</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НомерICQ</Name>
					<Comment>Номер ICQ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
					<Comment>Другая контактная информация (произвольная)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>GoogleАккаунт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ПолФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ПолФизическихЛиц</Name>
			<Comment>Пол физических лиц</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеУказан</Name>
					<Comment>Пол не указан</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Мужской</Name>
					<Comment>Пол мужской</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Женский</Name>
					<Comment>Пол женский</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ФормыСобственности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ФормыСобственности</Name>
			<Comment>Варианты форм собственности контрагентов</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
					<Comment>Любая форма юридического лица</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастныйПредприниматель</Name>
					<Comment>Частный предприниматель</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастноеЛицо</Name>
					<Comment>Частное лицо</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбособленноеПодразделение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
					<Comment>Прочий вид собственности</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыКонтрагентов</Name>
			<Comment>Виды контрагентов</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Покупатель</Name>
					<Comment>Основное взаимодействие с контрагентом - продажа, передача на комиссию, хранение</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поставщик</Name>
					<Comment>Основное взаимодействие с контрагентом - закупка и принятие на комиссию, хранение</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодотчетноеЛицо</Name>
					<Comment>Подотчетное лицо компании</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Филиал</Name>
					<Comment>Филиал компании, одна из организаций</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Собственник</Name>
					<Comment>Собственник компании, осуществляющий финансирование</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Comment>Контактное лицо</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
					<Comment>Прочие контрагенты</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

WebServices/CustomerVehicle/Ext/Module.bsl
Функция CustomerVehicleGet(CustomerVehicleGetRequest)
	// Вставить содержимое обработчика.
	CustomerVehicleGetType = ФабрикаXDTO.Тип("http://wa.dms.webservice/CustomerVehicleGetRequest", "CustomerVehicleGetResponse");
	CustomerVehicleGet = ФабрикаXDTO.Создать(CustomerVehicleGetType);   
	
	ТаблицаОщибок = Новый ТаблицаЗначений;
	ТаблицаОщибок.Колонки.Добавить("Код",	 Новый ОписаниеТипов("Строка"));
	ТаблицаОщибок.Колонки.Добавить("ТекстОшибки",		 Новый ОписаниеТипов("Строка"));
    	
	CustomersType = ФабрикаXDTO.Тип("http://wa.dms.webservice/CustomerVehicleGetRequest", "ArrayOfCustomerVehicle");
	Customers = ФабрикаXDTO.Создать(CustomersType); 	
	Попытка
		НомерКонтрагент = CustomerVehicleGetRequest.CustomerVehicleGet.CustomerGet.DMSCustomerNo;
	Исключение
		НомерКонтрагент = "";
	КонецПопытки;
	Попытка
		ФамилияКонтрагент = CustomerVehicleGetRequest.CustomerVehicleGet.CustomerGet.LastName;
	Исключение
		ФамилияКонтрагент = "";
	КонецПопытки;                                  	
	Если ЗначениеЗаполнено(ФамилияКонтрагент) Тогда
		Если СтрДлина(ФамилияКонтрагент) < 3 Тогда
			НоваяСтрока = ТаблицаОщибок.Добавить();
			НоваяСтрока.Код = "CVG01";
			НоваяСтрока.ТекстОшибки = "Для поиска по фамилии должно быть не менее 3 символов";
			CustomerVehicleGet = обПолучитьВозвратWAError("http://wa.dms.webservice/CustomerVehicleGetRequest",CustomerVehicleGetRequest,CustomerVehicleGet,"-1",ТаблицаОщибок);
			Возврат CustomerVehicleGet;  	
		КонецЕсли;     
	КонецЕсли;       
	
	Попытка
		ЭлПочтаКонтрагент = CustomerVehicleGetRequest.CustomerVehicleGet.CustomerGet.Email;
	Исключение
		ЭлПочтаКонтрагент = "";
	КонецПопытки;
	Если ЗначениеЗаполнено(ЭлПочтаКонтрагент) Тогда
		Если СтрДлина(ЭлПочтаКонтрагент)<3 Тогда
			НоваяСтрока = ТаблицаОщибок.Добавить();
			НоваяСтрока.Код = "CVG02";
			НоваяСтрока.ТекстОшибки = "Для поиска по эл. почте должно быть не менее 3 символов";
			CustomerVehicleGet = обПолучитьВозвратWAError("http://wa.dms.webservice/CustomerVehicleGetRequest",CustomerVehicleGetRequest,CustomerVehicleGet,"-1",ТаблицаОщибок);
			Возврат CustomerVehicleGet;  	
		КонецЕсли;      
	КонецЕсли;   	
	
	Попытка
		МассивКонтактовКонтрагента = CustomerVehicleGetRequest.CustomerVehicleGet.CustomerGet.Contacts;  
		Для Каждого Контакт Из МассивКонтактовКонтрагента.Contact Цикл
			Если Контакт.ContactType = "2" Тогда
				ТелефонФрагмент = Контакт.ContactValue;	 				
			КонецЕсли;
		КонецЦикла; 
	Исключение
		ТелефонФрагмент = ""; 
	КонецПопытки;
	Если ЗначениеЗаполнено(ТелефонФрагмент) Тогда
		Если СтрДлина(ТелефонФрагмент)<4 Тогда
			НоваяСтрока = ТаблицаОщибок.Добавить();
			НоваяСтрока.Код = "CVG04";
			НоваяСтрока.ТекстОшибки = "Для поиска по телефону должно быть не менее 4 символов";
			CustomerVehicleGet = обПолучитьВозвратWAError("http://wa.dms.webservice/CustomerVehicleGetRequest",CustomerVehicleGetRequest,CustomerVehicleGet,"-1",ТаблицаОщибок);
			Возврат CustomerVehicleGet;  	
		КонецЕсли;  
	КонецЕсли;  	
	
	Попытка	
		КодАвтомобиля = CustomerVehicleGetRequest.CustomerVehicleGet.VehicleGet.DMSVehicleNo;
	Исключение
		КодАвтомобиля = "";
	КонецПопытки;
	Попытка
		VINАвтомобиля = CustomerVehicleGetRequest.CustomerVehicleGet.VehicleGet.VIN;
	Исключение
		VINАвтомобиля = "";
	КонецПопытки;
	Если ЗначениеЗаполнено(VINАвтомобиля) Тогда 
		Если СтрДлина(VINАвтомобиля)<>17 Тогда
			НоваяСтрока = ТаблицаОщибок.Добавить();
			НоваяСтрока.Код = "CVG05";
			НоваяСтрока.ТекстОшибки = "VIN должно быть равен 17 символам";
			CustomerVehicleGet = обПолучитьВозвратWAError("http://wa.dms.webservice/CustomerVehicleGetRequest",CustomerVehicleGetRequest,CustomerVehicleGet,"-1",ТаблицаОщибок);
			Возврат CustomerVehicleGet;  
		КонецЕсли; 		
	КонецЕсли;	
	
	Попытка
		ПоследниеСимволыVIN = CustomerVehicleGetRequest.CustomerVehicleGet.VehicleGet.LastSixVIN;
	Исключение
		ПоследниеСимволыVIN = "";
	КонецПопытки;
	Если ЗначениеЗаполнено(ПоследниеСимволыVIN) Тогда
		Если СтрДлина(ПоследниеСимволыVIN)<6 Тогда
			НоваяСтрока = ТаблицаОщибок.Добавить();
			НоваяСтрока.Код = "CVG06";
			НоваяСтрока.ТекстОшибки = "Для поиску по фрагменту VIN должно быть не менее 6 символов";
			CustomerVehicleGet = обПолучитьВозвратWAError("http://wa.dms.webservice/CustomerVehicleGetRequest",CustomerVehicleGetRequest,CustomerVehicleGet,"-1",ТаблицаОщибок);
			Возврат CustomerVehicleGet;   
		КонецЕсли;
	КонецЕсли;
		
	Попытка
		ГосНомерАвтомобиля = CustomerVehicleGetRequest.CustomerVehicleGet.VehicleGet.LicensePlateNo; 
	Исключение
		ГосНомерАвтомобиля = "";
	КонецПопытки;
	Если ЗначениеЗаполнено(ГосНомерАвтомобиля) Тогда
		Если СтрДлина(ГосНомерАвтомобиля)<3 Тогда
			НоваяСтрока = ТаблицаОщибок.Добавить();
			НоваяСтрока.Код = "CVG07";
			НоваяСтрока.ТекстОшибки = "Для поиску по фрагменту гос. номера должно быть не менее 3 символов";
			CustomerVehicleGet = обПолучитьВозвратWAError("http://wa.dms.webservice/CustomerVehicleGetRequest",CustomerVehicleGetRequest,CustomerVehicleGet,"-1",ТаблицаОщибок);
			Возврат CustomerVehicleGet;   
		КонецЕсли;    
	КонецЕсли;        

	Запрос = Новый Запрос;
	Если ЗначениеЗаполнено(НомерКонтрагент) Тогда   		
		Запрос.Текст = "ВЫБРАТЬ
		               |	Контрагенты.Ссылка КАК Контрагент,
		               |	АвтомобилиСрезПоследних.Автомобиль.Ссылка КАК Автомобиль
		               |ИЗ
		               |	Справочник.Контрагенты КАК Контрагенты
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Автомобили.СрезПоследних(, Автомобиль.Модель В ИЕРАРХИИ (&Hyundai)) КАК АвтомобилиСрезПоследних
		               |		ПО (АвтомобилиСрезПоследних.Значение = Контрагенты.Ссылка)
		               |ГДЕ
		               |	Контрагенты.Код = &КодКонтрагента";
					   
		Запрос.Параметры.Вставить("Hyundai",Справочники.Модели.НайтиПоКоду("ЦБ00003644")); 
		Запрос.Параметры.Вставить("КодКонтрагента",НомерКонтрагент);
		
	ИначеЕсли ЗначениеЗаполнено(VINАвтомобиля) Тогда	                                                                        
		Запрос.Текст = "ВЫБРАТЬ
		               |	Контрагенты.Ссылка КАК Контрагент,
		               |	АвтомобилиСрезПоследних.Автомобиль.Ссылка КАК Автомобиль
		               |ИЗ
		               |	РегистрСведений.Автомобили.СрезПоследних(, ВидЗначения = &Хозяин) КАК АвтомобилиСрезПоследних
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
		               |		ПО АвтомобилиСрезПоследних.Значение = Контрагенты.Ссылка
		               |ГДЕ
		               |	АвтомобилиСрезПоследних.Автомобиль.Модель В ИЕРАРХИИ(&Hyundai)
		               |	И АвтомобилиСрезПоследних.Автомобиль.VIN = &VIN";
					   
		Запрос.Параметры.Вставить("Hyundai",Справочники.Модели.НайтиПоКоду("ЦБ00003644")); 
		Запрос.Параметры.Вставить("VIN",VINАвтомобиля);    	
		Запрос.Параметры.Вставить("Хозяин",Перечисления.ДополнительнаяИнформацияАвтомобилей.Хозяин);
		
	ИначеЕсли ЗначениеЗаполнено(КодАвтомобиля) Тогда	                                                                        
		Запрос.Текст = "ВЫБРАТЬ
		               |	Контрагенты.Ссылка КАК Контрагент,
		               |	АвтомобилиСрезПоследних.Автомобиль.Ссылка КАК Автомобиль
		               |ИЗ
		               |	РегистрСведений.Автомобили.СрезПоследних(, ВидЗначения = &Хозяин) КАК АвтомобилиСрезПоследних
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
		               |		ПО АвтомобилиСрезПоследних.Значение = Контрагенты.Ссылка
		               |ГДЕ
		               |	АвтомобилиСрезПоследних.Автомобиль.Модель В ИЕРАРХИИ(&Hyundai)
		               |	И АвтомобилиСрезПоследних.Автомобиль.Код = &Код";
					   
		Запрос.Параметры.Вставить("Hyundai",Справочники.Модели.НайтиПоКоду("ЦБ00003644")); 
		Запрос.Параметры.Вставить("Код",КодАвтомобиля);    	
		Запрос.Параметры.Вставить("Хозяин",Перечисления.ДополнительнаяИнформацияАвтомобилей.Хозяин);
		
	ИначеЕсли ЗначениеЗаполнено(ПоследниеСимволыVIN) ИЛИ ЗначениеЗаполнено(ФамилияКонтрагент) ИЛИ ЗначениеЗаполнено(ГосНомерАвтомобиля) ИЛИ ЗначениеЗаполнено(ТелефонФрагмент) ИЛИ ЗначениеЗаполнено(ЭлПочтаКонтрагент) Тогда	   
	    Запрос.Текст = "ВЫБРАТЬ
	                   |	Контрагенты.Ссылка КАК Контрагент,
	                   |	АвтомобилиСрезПоследних.Автомобиль.Ссылка КАК Автомобиль
	                   |ПОМЕСТИТЬ ФамилияИВИН
	                   |ИЗ
	                   |	РегистрСведений.Автомобили.СрезПоследних(, ВидЗначения = &Хозяин) КАК АвтомобилиСрезПоследних
	                   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	                   |		ПО АвтомобилиСрезПоследних.Значение = Контрагенты.Ссылка
	                   |ГДЕ
	                   |	АвтомобилиСрезПоследних.Автомобиль.Модель В ИЕРАРХИИ(&Hyundai)
	    			   |	"+?(ЗначениеЗаполнено(ПоследниеСимволыVIN),"И АвтомобилиСрезПоследних.Автомобиль.VIN ПОДОБНО &VIN","")+"
	                   |	"+?(ЗначениеЗаполнено(ФамилияКонтрагент),"И Контрагенты.Фамилия ПОДОБНО &Фамилия","")+"   					 
	                   |;
	                   |
	                   |////////////////////////////////////////////////////////////////////////////////
	                   |ВЫБРАТЬ ПЕРВЫЕ 200
	                   |	ФамилияИВИН.Контрагент,
	                   |	ФамилияИВИН.Автомобиль,
	                   |	ВЫРАЗИТЬ(АвтомобилиСрезПоследних.Значение КАК СТРОКА(12)) КАК ГосНомер
	                   |ПОМЕСТИТЬ ГосНомера
	                   |ИЗ
	                   |	ФамилияИВИН КАК ФамилияИВИН
	                   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Автомобили.СрезПоследних(, ВидЗначения = &ГосНомер) КАК АвтомобилиСрезПоследних
	                   |		ПО ФамилияИВИН.Автомобиль = АвтомобилиСрезПоследних.Автомобиль
					   |"+?(ЗначениеЗаполнено(ГосНомерАвтомобиля),"ГДЕ АвтомобилиСрезПоследних.Значение ПОДОБНО &ГосНомерФрагмент","")+"
	                   |;
	                   |
	                   |////////////////////////////////////////////////////////////////////////////////
	                   |ВЫБРАТЬ
	                   |	ГосНомера.Контрагент,
	                   |	ГосНомера.Автомобиль,
	                   |	ВложенныйЗапрос.Телефон,
	                   |	ВложенныйЗапрос1.ЭлПочта,
					   | 	ГосНомера.ГосНомер
	                   |ИЗ
	                   |	ГосНомера КАК ГосНомера
	                   |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                   |			КонтактнаяИнформация.Объект КАК Контрагент,
	                   |			ВЫРАЗИТЬ(КонтактнаяИнформация.Представление КАК СТРОКА(50)) КАК Телефон
	                   |		ИЗ
	                   |			РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	                   |		ГДЕ
	                   |			КонтактнаяИнформация.Тип = &ТипКИ
	                   |			И КонтактнаяИнформация.Вид = &ВидКИ
					   | И КонтактнаяИнформация.Объект В
					   |(ВЫБРАТЬ
					   |	ГосНомера.Контрагент
					   |ИЗ
				       |	ГосНомера КАК ГосНомера)) КАК ВложенныйЗапрос
	                   |		ПО ГосНомера.Контрагент = ВложенныйЗапрос.Контрагент
	                   |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                   |			КонтактнаяИнформация.Объект КАК Контрагент,
	                   |			ВЫРАЗИТЬ(КонтактнаяИнформация.Представление КАК СТРОКА(50)) КАК ЭлПочта
	                   |		ИЗ
	                   |			РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	                   |		ГДЕ
	                   |			КонтактнаяИнформация.Тип = &ТипЭлПочта
	                   |			И КонтактнаяИнформация.Вид = &ВидЭлПочта
					   |  И КонтактнаяИнформация.Объект В
					   |  (ВЫБРАТЬ
					   |  ГосНомера.Контрагент
					   |  ИЗ
					   |  ГосНомера КАК ГосНомера)) КАК ВложенныйЗапрос1
	                   |		ПО ГосНомера.Контрагент = ВложенныйЗапрос1.Контрагент
	                   |ГДЕ
	                   |	ГосНомера.Автомобиль.Модель В ИЕРАРХИИ(&Hyundai)
	                   |"+?(ЗначениеЗаполнено(ГосНомерАвтомобиля)," И ГосНомера.ГосНомер ПОДОБНО &ГосНомерФрагмент","")+"
	    			   |"+?(ЗначениеЗаполнено(ЭлПочтаКонтрагент)," И ВложенныйЗапрос1.ЭлПочта ПОДОБНО &ЭлПочтаФрагмент","")+"
	    			   |"+?(ЗначениеЗаполнено(ТелефонФрагмент)," И ВложенныйЗапрос.Телефон ПОДОБНО &ТелефонФрагмент","");
				   
		Запрос.Параметры.Вставить("Hyundai",Справочники.Модели.НайтиПоКоду("ЦБ00003644")); 
		Запрос.Параметры.Вставить("VIN","%"+ПоследниеСимволыVIN+"%");    	
		Запрос.Параметры.Вставить("Хозяин",Перечисления.ДополнительнаяИнформацияАвтомобилей.Хозяин); 		
		Запрос.Параметры.Вставить("Фамилия","%"+ФамилияКонтрагент+"%"); 
		Запрос.Параметры.Вставить("ГосНомерФрагмент","%"+ГосНомерАвтомобиля+"%");    	
		Запрос.Параметры.Вставить("ГосНомер",Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер); 
		Запрос.Параметры.Вставить("ТелефонФрагмент","%"+ТелефонФрагмент+"%");  
		Запрос.Параметры.Вставить("ТипКИ",Перечисления.ТипыКонтактнойИнформации.Телефон); 
		Запрос.Параметры.Вставить("ВидКИ",Справочники.ВидыКонтактнойИнформации.ТелефонКонтактный);  
		Запрос.Параметры.Вставить("ЭлПочтаФрагмент","%"+ЭлПочтаКонтрагент+"%");  
		Запрос.Параметры.Вставить("ВидЭлПочта",Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыДомашний); 
		Запрос.Параметры.Вставить("ТипЭлПочта",Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);  

	Иначе
		НоваяСтрока = ТаблицаОщибок.Добавить();
		НоваяСтрока.Код = "WA02";
		НоваяСтрока.ТекстОшибки = "Не заполено ни одно из полей для поиска контрагентов";
		CustomerVehicleGet = обПолучитьВозвратWAError("http://wa.dms.webservice/CustomerVehicleGetRequest",CustomerVehicleGetRequest,CustomerVehicleGet,"-1",ТаблицаОщибок);
		Возврат CustomerVehicleGet;  		
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();

    Если Выборка.Количество()=0 Тогда                         		
		CustomerVehicleGet = обПолучитьВозвратWAError("http://wa.dms.webservice/CustomerVehicleGetRequest",CustomerVehicleGetRequest,CustomerVehicleGet,"0",ТаблицаОщибок);
		Возврат CustomerVehicleGet;  		
	Иначе
		Пока Выборка.Следующий() Цикл 			

			//Если ЗначениеЗаполнено(ФамилияКонтрагент) Тогда
			//	Фамилия = обПолучитьФамилия(Выборка.Контрагент.Наименование);
			//	Если нрег(Фамилия)<>нрег(ФамилияКонтрагент) Тогда
			//		продолжить;
			//	КонецЕсли;
			//КонецЕсли;
			
			CustomerVehicleType = ФабрикаXDTO.Тип("http://wa.dms.webservice/CustomerVehicleGetRequest", "CustomerVehicle");
			CustomerVehicle = ФабрикаXDTO.Создать(CustomerVehicleType);
			
			CustomerType = ФабрикаXDTO.Тип("http://wa.dms.webservice/CustomerVehicleGetRequest", "Customer");
			CustomerData = ФабрикаXDTO.Создать(CustomerType);
		    CustomerData = обGetCustomer("http://wa.dms.webservice/CustomerVehicleGetRequest", CustomerData, Выборка.Контрагент, "1");               			
			CustomerVehicle.Customer = CustomerData; 			
			
			VehicleType = ФабрикаXDTO.Тип("http://wa.dms.webservice/CustomerVehicleGetRequest", "Vehicle");
			VehicleData = ФабрикаXDTO.Создать(VehicleType);
			VehicleData = обGetVehicle("http://wa.dms.webservice/CustomerVehicleGetRequest", VehicleData, Выборка.Автомобиль);
			CustomerVehicle.Vehicle = VehicleData;  
		
			Customers.CustomerVehicle.Добавить(CustomerVehicle);
		КонецЦикла;
	КонецЕсли;
	
	CustomerVehicleGet.CustomerVehicles = Customers;
	CustomerVehicleGet = обПолучитьВозвратWAError("http://wa.dms.webservice/CustomerVehicleGetRequest",CustomerVehicleGetRequest,CustomerVehicleGet,"1",ТаблицаОщибок);
	Возврат CustomerVehicleGet;  
КонецФункции                                                                

Функция CustomerNehicleChange(CustomerVehicleChangeRequest)
	// Вставить содержимое обработчика.
	CustomerVehicleChangeType = ФабрикаXDTO.Тип("http://wa.dms.webservice/CustomerVehicleGetRequest", "CustomerVehicleChangeResponse");
	CustomerVehicleChange = ФабрикаXDTO.Создать(CustomerVehicleChangeType);   
	
	ТаблицаОщибок = Новый ТаблицаЗначений;
	ТаблицаОщибок.Колонки.Добавить("Код", Новый ОписаниеТипов("Строка"));
	ТаблицаОщибок.Колонки.Добавить("ТекстОшибки", Новый ОписаниеТипов("Строка"));   
	
	// Контрагент \\
	Попытка
		DMSCustomerNo = CustomerVehicleChangeRequest.CustomerVehicleChange.Customer.DMSCustomerNo;  
	Исключение
		DMSCustomerNo = Неопределено;
	КонецПопытки;
	Попытка
		CustomerFullName = CustomerVehicleChangeRequest.CustomerVehicleChange.Customer.FullName;
	Исключение
		CustomerFullName = "";
	КонецПопытки;  	
	Попытка
		Gender = CustomerVehicleChangeRequest.CustomerVehicleChange.Customer.Gender;
	Исключение
		Gender = "";
	КонецПопытки;
	Попытка
		CustomerEmail = CustomerVehicleChangeRequest.CustomerVehicleChange.Customer.Email;
	Исключение
		CustomerEmail = "";
	КонецПопытки;    
	
	ТаблицаАдресов = Новый ТаблицаЗначений;
	ТаблицаАдресов.Колонки.Добавить("AddressType",	 Новый ОписаниеТипов("Строка"));
	//ТаблицаАдресов.Колонки.Добавить("FullAddress",	 Новый ОписаниеТипов("Строка"));
	ТаблицаАдресов.Колонки.Добавить("ZipCode",		 Новый ОписаниеТипов("Строка"));
	ТаблицаАдресов.Колонки.Добавить("Region",		 Новый ОписаниеТипов("Строка"));
    ТаблицаАдресов.Колонки.Добавить("District",		 Новый ОписаниеТипов("Строка"));
	ТаблицаАдресов.Колонки.Добавить("City",			 Новый ОписаниеТипов("Строка"));
	ТаблицаАдресов.Колонки.Добавить("Locality",		 Новый ОписаниеТипов("Строка"));
	ТаблицаАдресов.Колонки.Добавить("Street",		 Новый ОписаниеТипов("Строка"));
	ТаблицаАдресов.Колонки.Добавить("House",		 Новый ОписаниеТипов("Строка"));
	ТаблицаАдресов.Колонки.Добавить("Housing",		 Новый ОписаниеТипов("Строка"));
	ТаблицаАдресов.Колонки.Добавить("Flat",			 Новый ОписаниеТипов("Строка"));

    Попытка
		МассивАдресовКонтрагента = CustomerVehicleChangeRequest.CustomerVehicleChange.Customer.Addresses;  
		Для Каждого Адрес Из МассивАдресовКонтрагента.Address Цикл
			Если Адрес.FullAddress = "" тогда
				Продолжить;
			КонецЕсли;	
			НоваяСтрока = ТаблицаАдресов.Добавить();	
			НоваяСтрока.AddressType = Адрес.AddressType;
			//НоваяСтрока.FullAddress = Адрес.FullAddress;
			НоваяСтрока.ZipCode = Адрес.ZipCode;
			НоваяСтрока.Region = Адрес.Region;
			НоваяСтрока.District = Адрес.District;
			НоваяСтрока.City = Адрес.City;
			НоваяСтрока.Locality = Адрес.Locality;
			НоваяСтрока.Street = Адрес.Street;
			НоваяСтрока.House = Адрес.House;
			НоваяСтрока.Housing = Адрес.Housing;
			НоваяСтрока.Flat = Адрес.Flat;
		КонецЦикла; 
	Исключение
	КонецПопытки;      
	ТаблицаТелефонов = Новый ТаблицаЗначений;
	ТаблицаТелефонов.Колонки.Добавить("ContactType",		 Новый ОписаниеТипов("Строка"));
	ТаблицаТелефонов.Колонки.Добавить("ContactValue",		 Новый ОписаниеТипов("Строка"));
	ТаблицаТелефонов.Колонки.Добавить("ContactMethodYN",	 Новый ОписаниеТипов("Строка"));
    Попытка
		МассивКонтактовКонтрагента = CustomerVehicleChangeRequest.CustomerVehicleChange.Customer.Contacts;  
		Для Каждого Телефон Из МассивКонтактовКонтрагента.Contact Цикл
			Если Телефон.ContactValue = "" тогда
				Продолжить;	
			КонецЕсли;
			НоваяСтрока = ТаблицаТелефонов.Добавить();	
			НоваяСтрока.ContactType = Телефон.ContactType;
			НоваяСтрока.ContactValue = Телефон.ContactValue;
			НоваяСтрока.ContactMethodYN = Телефон.ContactMethodYN;
		КонецЦикла; 
	Исключение
	КонецПопытки;
	
	Попытка 
		КонтактноеЛицо = Новый Структура;	
		Для Каждого РеквизитКонтактногоЛица Из CustomerVehicleChangeRequest.CustomerVehicleChange.Customer.CorporateInfos.CorporateInfo Цикл
			КонтактноеЛицо.Вставить( Строка(РеквизитКонтактногоЛица.CorporateInfoName) , РеквизитКонтактногоЛица.CorporateInfoValue);
		КонецЦикла;
	Исключение 		
	КонецПопытки;
	
	Попытка
		CustomerSpecialMessage = CustomerVehicleChangeRequest.CustomerVehicleChange.Customer.SpecialMessage.Message;
	Исключение
		CustomerSpecialMessage = "";
	КонецПопытки;
	
	Запрос = Новый Запрос;
	
	Если DMSCustomerNo <> Неопределено Тогда
		Если ЗначениеЗаполнено(DMSCustomerNo) Тогда   		
			Запрос.Текст = "ВЫБРАТЬ
			               |	Контрагенты.Ссылка КАК Контрагент,
			               |	АвтомобилиСрезПоследних.Автомобиль.Ссылка КАК Автомобиль
			               |ИЗ
			               |	Справочник.Контрагенты КАК Контрагенты
			               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Автомобили.СрезПоследних(, Автомобиль.Модель В ИЕРАРХИИ (&Hyundai)) КАК АвтомобилиСрезПоследних
			               |		ПО (АвтомобилиСрезПоследних.Значение = Контрагенты.Ссылка)
			               |ГДЕ
			               |	Контрагенты.Код = &КодКонтрагента";
						   
			Запрос.Параметры.Вставить("Hyundai",Справочники.Модели.НайтиПоКоду("ЦБ00003644")); 
			Запрос.Параметры.Вставить("КодКонтрагента",DMSCustomerNo);    	
			Выборка = Запрос.Выполнить().Выбрать();

			Если Выборка.Количество()=0 Тогда                     		
				НоваяСтрока = ТаблицаОщибок.Добавить();
				НоваяСтрока.Код = "CVC01";
				НоваяСтрока.ТекстОшибки = "Неверный код контрагента";
				CustomerVehicleChange = обПолучитьВозвратWAError("http://wa.dms.webservice/CustomerVehicleGetRequest",CustomerVehicleChangeRequest,CustomerVehicleChange,"-1",ТаблицаОщибок);
				Возврат CustomerVehicleChange;  
			Иначе
				Выборка.Следующий();
				КонтрСсылка = Выборка.Контрагент;
				КонтрОбъект = КонтрСсылка.ПолучитьОбъект();  			
				Если ЗначениеЗаполнено(CustomerFullName) Тогда
					КонтрОбъект.Наименование = CustomerFullName;  
				КонецЕсли;      
			КонецЕсли;
		Иначе
			КонтрОбъект = Справочники.Контрагенты.СоздатьЭлемент();
			Если ЗначениеЗаполнено(CustomerFullName) Тогда
				КонтрОбъект.Наименование = CustomerFullName;  
				КонтрОбъект.УстановитьНовыйКод();
				КонтрОбъект.Записать();
				КонтрСсылка = КонтрОбъект.Ссылка;
			Иначе
				НоваяСтрока = ТаблицаОщибок.Добавить();
				НоваяСтрока.Код = "CVC02";
				НоваяСтрока.ТекстОшибки = "Не заполнено обязательное поле <Наименование>";
				CustomerVehicleChange = обПолучитьВозвратWAError("http://wa.dms.webservice/CustomerVehicleGetRequest",CustomerVehicleChangeRequest,CustomerVehicleChange,"-1",ТаблицаОщибок);
				Возврат CustomerVehicleChange;  
			КонецЕсли;       
		КонецЕсли;    		
				
		Если ЗначениеЗаполнено(Gender) Тогда
			Если Gender = "1" Тогда 
				КонтрОбъект.Пол = Перечисления.ПолФизическихЛиц.Мужской; 
			Иначе
				КонтрОбъект.Пол = Перечисления.ПолФизическихЛиц.Женский; 
	        КонецЕсли;				
		КонецЕсли;  
		
		Если ЗначениеЗаполнено(CustomerSpecialMessage) Тогда
			КонтрОбъект.Комментарий = CustomerSpecialMessage;  
		КонецЕсли;   
		
		Если ЗначениеЗаполнено(CustomerEmail) Тогда
			Запись = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
			Запись.Объект = КонтрСсылка;
	   		Запись.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
			Запись.Вид = Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыДомашний;                   
			Запись.Представление	= СокрЛП(CustomerEmail);
			Попытка
				Запись.Записать(Истина);
			Исключение
				НоваяСтрока = ТаблицаОщибок.Добавить();
				НоваяСтрока.Код = "WA03";
				НоваяСтрока.ТекстОшибки = ОписаниеОшибки();
				CustomerVehicleChange = обПолучитьВозвратWAError("http://wa.dms.webservice/CustomerVehicleGetRequest",CustomerVehicleChangeRequest,CustomerVehicleChange,"-1",ТаблицаОщибок);
				Возврат CustomerVehicleChange;       
			КонецПопытки;
		КонецЕсли;
		
		Для Каждого Строка Из ТаблицаАдресов Цикл
			Запись = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
			Запись.Объект = КонтрСсылка;
	   		Запись.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес; 			
			Если Строка.AddressType =  "1" Тогда
				Запись.Вид = Справочники.ВидыКонтактнойИнформации.АдресЮридический;
			ИначеЕсли Строка.AddressType = "2" Тогда
				Запись.Вид =  Справочники.ВидыКонтактнойИнформации.АдресФактический;  
			Иначе
				Запись.Вид = Справочники.ВидыКонтактнойИнформации.АдресПочтовый;
			КонецЕсли;    			 
			Запись.Поле1 = СокрЛП(Строка.ZipCode);
			Запись.Поле2 = СокрЛП(Строка.Region);
			Запись.Поле3 = СокрЛП(Строка.District);
			Запись.Поле4 = СокрЛП(Строка.City); 
			Запись.Поле5 = СокрЛП(Строка.Locality);
			Запись.Поле6 = СокрЛП(Строка.Street);
			Запись.Поле7 = СокрЛП(Строка.House);
			Запись.Поле8 = СокрЛП(Строка.Housing);
			Запись.Поле9 = СокрЛП(Строка.Flat);  
			Запись.Представление = киПолучитьПредставлениеАдреса(Запись);
			Попытка
				Запись.Записать(Истина);
			Исключение
				НоваяСтрока = ТаблицаОщибок.Добавить();
				НоваяСтрока.Код = "CVC04";
				НоваяСтрока.ТекстОшибки = ОписаниеОшибки();
				CustomerVehicleChange = обПолучитьВозвратWAError("http://wa.dms.webservice/CustomerVehicleGetRequest",CustomerVehicleChangeRequest,CustomerVehicleChange,"-1",ТаблицаОщибок);
				Возврат CustomerVehicleChange;    
			КонецПопытки;     			
		КонецЦикла;
		
		Для Каждого ТелефонСтрока Из ТаблицаТелефонов Цикл        			
			глПрава = обПолучитьПраваИНастройкиПользователя(ПараметрыСеанса.Пользователь); 	
			ЧислоХранимыхЦифрНомера = обПраво("ПоследниеЦифрыТелефонногоНомера",глПрава);   		
			Запись = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
			Запись.Объект = КонтрСсылка;
	   		Запись.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;  			
			Если ТелефонСтрока.ContactType =  "1" Тогда
				Запись.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонДомашний;
			ИначеЕсли ТелефонСтрока.ContactType = "2" Тогда
				Запись.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонКонтактный;
			Иначе
				Запись.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонРабочий;
			КонецЕсли;   		                   
			
			Если ЗначениеЗаполнено(ТелефонСтрока.ContactValue) Тогда
				НомерТелефона = СокрЛП(ТелефонСтрока.ContactValue);
				Запись.Поле1 = Лев(НомерТелефона, 2);
				НомерТелефона = кмсфпУбратьИзНомераТелефонаВсеБуквы(НомерТелефона);
				Если СтрДлина(НомерТелефона) < 11 Тогда
					НоваяСтрока = ТаблицаОщибок.Добавить();
					НоваяСтрока.Код = "CVC05";
					НоваяСтрока.ТекстОшибки = "Номер телефона должен содержать не менее 11 цифр";
					CustomerVehicleChange = обПолучитьВозвратWAError("http://wa.dms.webservice/CustomerVehicleGetRequest",CustomerVehicleChangeRequest,CustomerVehicleChange,"-1",ТаблицаОщибок);
					Возврат CustomerVehicleChange;    
				КонецЕсли;
				НомерТелефона = Сред(НомерТелефона, 2, 10);
				Запись.Поле2 = Лев(НомерТелефона, 3);
				Запись.Поле3 = Сред(НомерТелефона, 4);
				Запись.Представление = Запись.Поле1 + ", " + Запись.Поле2 + Запись.Поле3;
			Иначе
				Продолжить;
			КонецЕсли;
			Запись.CRM_ПолеХраненияНомера = кмсфпПреобразоватьНомерДляСохранения(ТелефонСтрока.ContactValue, ЧислоХранимыхЦифрНомера);  		
			
			Попытка
				Запись.Записать(Истина);
			Исключение
				НоваяСтрока = ТаблицаОщибок.Добавить();
				НоваяСтрока.Код = "WA03";
				НоваяСтрока.ТекстОшибки = ОписаниеОшибки();
				CustomerVehicleChange = обПолучитьВозвратWAError("http://wa.dms.webservice/CustomerVehicleGetRequest",CustomerVehicleChangeRequest,CustomerVehicleChange,"-1",ТаблицаОщибок);
				Возврат CustomerVehicleChange;    
			КонецПопытки; 		
		КонецЦикла;
		
		Попытка
			КонтрОбъект.Записать();
		Исключение
			НоваяСтрока = ТаблицаОщибок.Добавить();
			НоваяСтрока.Код = "WA03";
			НоваяСтрока.ТекстОшибки = ОписаниеОшибки();
			CustomerVehicleChange = обПолучитьВозвратWAError("http://wa.dms.webservice/CustomerVehicleGetRequest",CustomerVehicleChangeRequest,CustomerVehicleChange,"-1",ТаблицаОщибок);
			Возврат CustomerVehicleChange;    
		КонецПопытки; 
		
		//Запись контактного лица - если новый - создаем новое контактное лицо, если не новый - ищем в ТЧ контактные лица и меняем данные.		
		Если КонтактноеЛицо.Свойство("ContactPersonID") И ЗначениеЗаполнено(КонтактноеЛицо.ContactPersonID) Тогда  			
			КонтактноеЛицоСпр = Справочники.Контрагенты.НайтиПоКоду(КонтактноеЛицо.ContactPersonID);			
			//Если контрагент найден
			Если ЗначениеЗаполнено(КонтактноеЛицоСпр) Тогда 				
				КонтактноеЛицоСпрОбъект 					= КонтактноеЛицоСпр.ПолучитьОбъект(); 
				КонтактноеЛицоСпрОбъект.ВедушийКонтрагент 	= КонтрСсылка;
				КонтактноеЛицоСпрОбъект.Наименование		= КонтактноеЛицо.ContactPerson;
				КонтактноеЛицоСпрОбъект.НаименованиеПолное 	= КонтактноеЛицо.ContactPerson;
				КонтактноеЛицоСпрОбъект.ОбменДанными.Загрузка = Истина;
				КонтактноеЛицоСпрОбъект.Записать();
				
				КонтактныйНомер 							= СтрЗаменить(СтрЗаменить(СтрЗаменить(КонтактноеЛицо.ContactNumber," ",""),"(",""),")","");
				Запись 										= РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
				Запись.Объект 								= КонтактноеЛицоСпр;
	   			Запись.Тип 									= Перечисления.ТипыКонтактнойИнформации.Телефон;  			
				Запись.Вид 									= Справочники.ВидыКонтактнойИнформации.ТелефонРабочий;
				Запись.Представление						= СокрЛП(КонтактныйНомер);
				Запись.CRM_ПолеХраненияНомера 				= кмсфпПреобразоватьНомерДляСохранения(КонтактныйНомер, ЧислоХранимыхЦифрНомера);//!!!!!!!!!  		
				Если СтрДлина(КонтактноеЛицо.ContactNumber) = 12 Тогда
					Запись.Поле5 							= СокрЛП(КонтактныйНомер);
					Запись.Поле3 							= Прав(КонтактныйНомер,7);
					Запись.Поле2 							= Сред(КонтактныйНомер,3,3);
					Запись.Поле1 							= Лев(КонтактныйНомер,2);
				ИначеЕсли СтрДлина(Строка.ContactValue) 	= 11 Тогда
					Запись.Поле5 							= СокрЛП(КонтактныйНомер);
					Запись.Поле3 							= Прав(КонтактныйНомер,7);
					Запись.Поле2 							= Сред(КонтактныйНомер,2,3);
					Запись.Поле1 							= Лев(КонтактныйНомер,1);
				КонецЕсли;
				Запись.Записать(Истина);
							
			Иначе 
				НоваяСтрока 			= ТаблицаОщибок.Добавить();
				НоваяСтрока.Код 		= "CVC08";
				НоваяСтрока.ТекстОшибки = "Неверный код контактного лица контрагента";;
				CustomerVehicleChange 	= ПолучитьВозвратWAError("http://wa.dms.webservice/CustomerVehicleGetRequest",CustomerVehicleChangeRequest,CustomerVehicleChange,"-1",ТаблицаОщибок);
				Возврат CustomerVehicleChange;				
			КонецЕсли;
												
		ИначеЕсли НЕ КонтактноеЛицо.Свойство("ContactPersonID") И КонтактноеЛицо.Свойство("ContactNumber") И ЗначениеЗаполнено(КонтактноеЛицо.ContactNumber)
			ИЛИ КонтактноеЛицо.Свойство("ContactPersonID") И НЕ ЗначениеЗаполнено( КонтактноеЛицо.ContactPersonID) И (КонтактноеЛицо.Свойство("ContactPerson") И ЗначениеЗаполнено(КонтактноеЛицо.ContactPerson))
			И КонтактноеЛицо.Свойство("ContactNumber") И ЗначениеЗаполнено(КонтактноеЛицо.ContactNumber) Тогда 
			КонтактноеЛицоСпрОбъект = Справочники.Контрагенты.СоздатьЭлемент();
			КонтактноеЛицоСпрОбъект.Наименование 		= КонтактноеЛицо.ContactPerson;
			КонтактноеЛицоСпрОбъект.НаименованиеПолное 	= КонтактноеЛицо.ContactPerson;
			КонтактноеЛицоСпрОбъект.ВедушийКонтрагент 	= КонтрСсылка;
			КонтактноеЛицоСпрОбъект.Родитель 	        = Справочники.Контрагенты.КонтактныеЛица;
			КонтактноеЛицоСпрОбъект.ФормаСобственности	= Перечисления.ФормыСобственности.ЧастноеЛицо;
			КонтактноеЛицоСпрОбъект.ВидКонтрагента		= Перечисления.ВидыКонтрагентов.КонтактноеЛицо;
			КонтактноеЛицоСпрОбъект.СогласиеНаОбработкуПерсональныхДанных	= Перечисления.ВариантыОтветов.Да;
			КонтактноеЛицоСпрОбъект.ОбменДанными.Загрузка = Истина;
			КонтактноеЛицоСпрОбъект.Записать();
			
			КонтактныйНомер 							= СтрЗаменить(СтрЗаменить(СтрЗаменить(КонтактноеЛицо.ContactNumber," ",""),"(",""),")","");
			Запись 										= РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
			Запись.Объект 								= КонтактноеЛицоСпрОбъект.Ссылка;
	   		Запись.Тип 									= Перечисления.ТипыКонтактнойИнформации.Телефон;  			
			Запись.Вид 									= Справочники.ВидыКонтактнойИнформации.ТелефонРабочий;
			Запись.Представление						= СокрЛП(КонтактныйНомер);
			Запись.CRM_ПолеХраненияНомера 				= кмсфпПреобразоватьНомерДляСохранения(КонтактныйНомер, ЧислоХранимыхЦифрНомера);  		
			Если СтрДлина(КонтактноеЛицо.ContactNumber) = 12 Тогда
				Запись.Поле5 							= СокрЛП(КонтактныйНомер);
				Запись.Поле3 							= Прав(КонтактныйНомер,7);
				Запись.Поле2 							= Сред(КонтактныйНомер,3,3);
				Запись.Поле1 							= Лев(КонтактныйНомер,2);
			ИначеЕсли СтрДлина(КонтактноеЛицо.ContactNumber) 	= 11 Тогда
				Запись.Поле5 							= СокрЛП(КонтактныйНомер);
				Запись.Поле3 							= Прав(КонтактныйНомер,7);
				Запись.Поле2 							= Сред(КонтактныйНомер,2,3);
				Запись.Поле1 							= Лев(КонтактныйНомер,1);
			КонецЕсли;
			Запись.Записать(Истина);
		Иначе
			НоваяСтрока 			= ТаблицаОщибок.Добавить();
			НоваяСтрока.Код 		= "CVC09";
			НоваяСтрока.ТекстОшибки = ОписаниеОшибки();
			CustomerVehicleChange 	= ПолучитьВозвратWAError("http://wa.dms.webservice/CustomerVehicleGetRequest",CustomerVehicleChangeRequest,CustomerVehicleChange,"-1",ТаблицаОщибок);
			Возврат CustomerVehicleChange;
		КонецЕсли;
	КонецЕсли;
	
	// Автомобиль \\
	Попытка
		DMSVehicleNo = CustomerVehicleChangeRequest.CustomerVehicleChange.Vehicle.DMSVehicleNo;  
	Исключение
		DMSVehicleNo = Неопределено;	
	КонецПопытки;
	Попытка
		VIN = CustomerVehicleChangeRequest.CustomerVehicleChange.Vehicle.VIN;
	Исключение
		VIN = "";
	КонецПопытки;  	
	Попытка
		LicensePlateNo = CustomerVehicleChangeRequest.CustomerVehicleChange.Vehicle.LicensePlateNo;
	Исключение
		LicensePlateNo = "";
	КонецПопытки;
	Попытка
		ModelCode = CustomerVehicleChangeRequest.CustomerVehicleChange.Vehicle.ModelCode;
	Исключение
		ModelCode = "";
	КонецПопытки;    
    Попытка      // вопрос
		ModelName = CustomerVehicleChangeRequest.CustomerVehicleChange.Vehicle.ModelName;
	Исключение
		ModelName = "";
	КонецПопытки;  	
	Попытка          // вопрос
		ModelYear = CustomerVehicleChangeRequest.CustomerVehicleChange.Vehicle.ModelYear;
	Исключение
		ModelYear = "";
	КонецПопытки;
	Попытка
		LastMileage = CustomerVehicleChangeRequest.CustomerVehicleChange.Vehicle.LastMileage;
	Исключение
		LastMileage = "";
	КонецПопытки;       	
	Попытка        // вопрос
		Color = CustomerVehicleChangeRequest.CustomerVehicleChange.Vehicle.Color;
	Исключение
		Color = "";
	КонецПопытки;  	
	Попытка       
		VehicleType = CustomerVehicleChangeRequest.CustomerVehicleChange.Vehicle.VehicleType;
	Исключение
		VehicleType = "";
	КонецПопытки;
	Попытка              // не будем брать, так как определится с помощью авторазбора VIN
		EngineType = CustomerVehicleChangeRequest.CustomerVehicleChange.Vehicle.LastMileage;
	Исключение
		EngineType = "";
	КонецПопытки;    	
	Попытка
		WarrantyStartDate = CustomerVehicleChangeRequest.CustomerVehicleChange.Vehicle.WarrantyStartDate;
	Исключение
		WarrantyStartDate = "";
	КонецПопытки;  	

	Если Не DMSVehicleNo=Неопределено Тогда
		Если ЗначениеЗаполнено(DMSVehicleNo) Тогда
			АвтомобильСсылка = Справочники.Автомобили.НайтиПоКоду(DMSVehicleNo);
			Если АвтомобильСсылка = Справочники.Автомобили.ПустаяСсылка() Тогда
				НоваяСтрока = ТаблицаОщибок.Добавить();
				НоваяСтрока.Код = "CVC06";
				НоваяСтрока.ТекстОшибки = "Неверный код автомобиля";
				CustomerVehicleChange = обПолучитьВозвратWAError("http://wa.dms.webservice/CustomerVehicleGetRequest",CustomerVehicleChangeRequest,CustomerVehicleChange,"-1",ТаблицаОщибок);
				Возврат CustomerVehicleChange;  
			Иначе
				АвтомобильОбъект = АвтомобильСсылка.ПолучитьОбъект();
			КонецЕсли;
		Иначе
			АвтомобильОбъект = Справочники.Автомобили.СоздатьЭлемент();
			Если ЗначениеЗаполнено(VIN) Тогда
				АвтомобильОбъект.VIN = VIN;
			Иначе
				НоваяСтрока = ТаблицаОщибок.Добавить();
				НоваяСтрока.Код = "CVC07";
				НоваяСтрока.ТекстОшибки = "Неверный VIN автомобиля";
				CustomerVehicleChange = обПолучитьВозвратWAError("http://wa.dms.webservice/CustomerVehicleGetRequest",CustomerVehicleChangeRequest,CustomerVehicleChange,"-1",ТаблицаОщибок);
				Возврат CustomerVehicleChange;        
			КонецЕсли;
			Если ЗначениеЗаполнено(ModelCode) Тогда
				МодельСсылка = Справочники.Модели.НайтиПоКоду(ModelCode);  
				// что будет если не найдем...
				АвтомобильОбъект.Модель = МодельСсылка;			
				Попытка
					АвтомобильОбъект.Записать();
				Исключение
					НоваяСтрока = ТаблицаОщибок.Добавить();
					НоваяСтрока.Код = "WA03";
					НоваяСтрока.ТекстОшибки = "Неверный код модели";
					CustomerVehicleChange = обПолучитьВозвратWAError("http://wa.dms.webservice/CustomerVehicleGetRequest",CustomerVehicleChangeRequest,CustomerVehicleChange,"-1",ТаблицаОщибок);
					Возврат CustomerVehicleChange;  
				КонецПопытки;  
				АвтомобильСсылка = АвтомобильОбъект.Ссылка;
			Иначе
				НоваяСтрока = ТаблицаОщибок.Добавить();
				НоваяСтрока.Код = "WA03";
				НоваяСтрока.ТекстОшибки = "Не заполнены обязательные поля для записи нового автомобиля";
				CustomerVehicleChange = обПолучитьВозвратWAError("http://wa.dms.webservice/CustomerVehicleGetRequest",CustomerVehicleChangeRequest,CustomerVehicleChange,"-1",ТаблицаОщибок);
				Возврат CustomerVehicleChange;        
			КонецЕсли; 		
		КонецЕсли;
		
		Если ЗначениеЗаполнено(WarrantyStartDate) Тогда
			АвтомобильОбъект.ДатаНачалаГарантии = WarrantyStartDate;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(LicensePlateNo) Тогда
			//АвтомобильОбъект.ЗаписьЗначенияРегистраСведения(LicensePlateNo,Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер);
			Справочники.Автомобили.ЗаписьЗначенияРегистраСведения(АвтомобильОбъект,LicensePlateNo,Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(LastMileage) Тогда
			//Отказ = АвтомобильОбъект.ЗаписьЗначенияРегистраСведения(Число(LastMileage),Перечисления.ДополнительнаяИнформацияАвтомобилей.Пробег);
			Отказ = Справочники.Автомобили.ЗаписьЗначенияРегистраСведения(АвтомобильОбъект,Число(LastMileage),Перечисления.ДополнительнаяИнформацияАвтомобилей.Пробег);
			
			Если Отказ Тогда
				НоваяСтрока = ТаблицаОщибок.Добавить();
				НоваяСтрока.Код = "CVC08";
				НоваяСтрока.ТекстОшибки = "Ошибка при установке пробега";
				CustomerVehicleChange = обПолучитьВозвратWAError("http://wa.dms.webservice/CustomerVehicleGetRequest",CustomerVehicleChangeRequest,CustomerVehicleChange,"-1",ТаблицаОщибок);
				Возврат CustomerVehicleChange;    
			КонецЕсли;
		КонецЕсли;

		Попытка
			АвтомобильОбъект.Записать();
		Исключение
			НоваяСтрока = ТаблицаОщибок.Добавить();
			НоваяСтрока.Код = "WA03";
			НоваяСтрока.ТекстОшибки = ОписаниеОшибки();
			CustomerVehicleChange = обПолучитьВозвратWAError("http://wa.dms.webservice/CustomerVehicleGetRequest",CustomerVehicleChangeRequest,CustomerVehicleChange,"-1",ТаблицаОщибок);
			Возврат CustomerVehicleChange;      
		КонецПопытки;    
	КонецЕсли;
	
	CustomerVehicleChange = обПолучитьВозвратWAError("http://wa.dms.webservice/CustomerVehicleGetRequest",CustomerVehicleChangeRequest,CustomerVehicleChange,"1",ТаблицаОщибок,?(DMSCustomerNo=Неопределено,DMSVehicleNo,DMSCustomerNo));
	Возврат CustomerVehicleChange;    
КонецФункции
